# Series

In [2]:
import numpy as np
import pandas as pd

In [3]:
# creating series

In [4]:
lable = ['a','b','c']
my_list = [10,20,30]
arr = np.array([40,50,60])
d = {'a':70,'b':80,'c':90}

In [5]:
# list

In [6]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [7]:
# or

pd.Series(data=my_list,index=lable)

a    10
b    20
c    30
dtype: int64

In [8]:
# using array

pd.Series(arr,lable)

a    40
b    50
c    60
dtype: int64

In [9]:
# index

In [10]:
s1 = pd.Series([1,2,3,4], index = ['A','B','C','D'])

In [11]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [12]:
s2 = pd.Series([1,2,5,4], index=['A','B','E','D'])

In [13]:
s2

A    1
B    2
E    5
D    4
dtype: int64

In [14]:
s1['A']

1

In [15]:
s2['E']

5

In [16]:
s1 + s2

A    2.0
B    4.0
C    NaN
D    8.0
E    NaN
dtype: float64

# DataFrame

In [17]:
import numpy as np
import pandas as pd

In [18]:
from numpy.random import randn

In [19]:
df = pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())

In [20]:
df

          W         X         Y         Z
A -1.056397 -0.036202  0.611073 -1.022471
B  1.331805  0.743591 -0.853736  1.575074
C  0.288442  1.752796 -0.370502  0.924538
D  0.607691 -0.048767  1.299274 -0.761469
E  0.078941 -0.710177 -0.792473  2.433566

In [21]:
# selection and indexing

In [22]:
df['W']

A   -1.056397
B    1.331805
C    0.288442
D    0.607691
E    0.078941
Name: W, dtype: float64

In [26]:
df[['X','Z']]

          X         Z
A -0.036202 -1.022471
B  0.743591  1.575074
C  1.752796  0.924538
D -0.048767 -0.761469
E -0.710177  2.433566

In [27]:
type(df[['X','Z']])

pandas.core.frame.DataFrame

In [28]:
type(df['W'])

pandas.core.series.Series

In [29]:
# making new column

In [30]:
df['N'] = df['X'] * 2.3

In [31]:
df

          W         X         Y         Z         N
A -1.056397 -0.036202  0.611073 -1.022471 -0.083265
B  1.331805  0.743591 -0.853736  1.575074  1.710259
C  0.288442  1.752796 -0.370502  0.924538  4.031431
D  0.607691 -0.048767  1.299274 -0.761469 -0.112165
E  0.078941 -0.710177 -0.792473  2.433566 -1.633408

In [32]:
# removing column

In [33]:
df.drop('N', axis=1)

          W         X         Y         Z
A -1.056397 -0.036202  0.611073 -1.022471
B  1.331805  0.743591 -0.853736  1.575074
C  0.288442  1.752796 -0.370502  0.924538
D  0.607691 -0.048767  1.299274 -0.761469
E  0.078941 -0.710177 -0.792473  2.433566

In [34]:
df

          W         X         Y         Z         N
A -1.056397 -0.036202  0.611073 -1.022471 -0.083265
B  1.331805  0.743591 -0.853736  1.575074  1.710259
C  0.288442  1.752796 -0.370502  0.924538  4.031431
D  0.607691 -0.048767  1.299274 -0.761469 -0.112165
E  0.078941 -0.710177 -0.792473  2.433566 -1.633408

In [35]:
# to remove completely

In [36]:
df.drop('N', axis=1,inplace=True)

In [37]:
df

          W         X         Y         Z
A -1.056397 -0.036202  0.611073 -1.022471
B  1.331805  0.743591 -0.853736  1.575074
C  0.288442  1.752796 -0.370502  0.924538
D  0.607691 -0.048767  1.299274 -0.761469
E  0.078941 -0.710177 -0.792473  2.433566

In [38]:
df.drop('E', axis=0)

          W         X         Y         Z
A -1.056397 -0.036202  0.611073 -1.022471
B  1.331805  0.743591 -0.853736  1.575074
C  0.288442  1.752796 -0.370502  0.924538
D  0.607691 -0.048767  1.299274 -0.761469

In [39]:
# selecting row

In [40]:
df.loc['A']

W   -1.056397
X   -0.036202
Y    0.611073
Z   -1.022471
Name: A, dtype: float64

In [41]:
df.iloc[2]

W    0.288442
X    1.752796
Y   -0.370502
Z    0.924538
Name: C, dtype: float64

In [42]:
df.loc['B','Y']

-0.8537355102587982

In [43]:
df.loc[['A','B'],['X','Z']]

          X         Z
A -0.036202 -1.022471
B  0.743591  1.575074

In [44]:
# conditional selection

In [45]:
df

          W         X         Y         Z
A -1.056397 -0.036202  0.611073 -1.022471
B  1.331805  0.743591 -0.853736  1.575074
C  0.288442  1.752796 -0.370502  0.924538
D  0.607691 -0.048767  1.299274 -0.761469
E  0.078941 -0.710177 -0.792473  2.433566

In [46]:
df>0

       W      X      Y      Z
A  False  False   True  False
B   True   True  False   True
C   True   True  False   True
D   True  False   True  False
E   True  False  False   True

In [47]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.611073       NaN
B  1.331805  0.743591       NaN  1.575074
C  0.288442  1.752796       NaN  0.924538
D  0.607691       NaN  1.299274       NaN
E  0.078941       NaN       NaN  2.433566

In [48]:
df[df['W']>0]

          W         X         Y         Z
B  1.331805  0.743591 -0.853736  1.575074
C  0.288442  1.752796 -0.370502  0.924538
D  0.607691 -0.048767  1.299274 -0.761469
E  0.078941 -0.710177 -0.792473  2.433566

In [52]:
df[df['W']>0]['X']

B    0.743591
C    1.752796
D   -0.048767
E   -0.710177
Name: X, dtype: float64

In [53]:
# MultiIndex

In [54]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [56]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.305384 -0.208597
   2  1.149071 -0.325568
   3  0.797090  0.143385
G2 1 -0.129198  1.597549
   2 -0.492104  0.961640
   3 -0.819926  0.814348

In [57]:
df.loc['G1']

          A         B
1  0.305384 -0.208597
2  1.149071 -0.325568
3  0.797090  0.143385

In [60]:
df.loc['G1'].loc[1]

A    0.305384
B   -0.208597
Name: 1, dtype: float64

# missing data

In [61]:
import numpy as np
import pandas as pd

In [62]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [63]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [64]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [65]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [66]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [67]:
df.fillna(value='V')

     A    B  C
0  1.0  5.0  1
1  2.0    V  2
2    V    V  3

In [68]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# groupby

In [69]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [70]:
df = pd.DataFrame(data)

In [71]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [72]:
df.groupby('Company')

In [73]:
by_comp = df.groupby("Company")

In [74]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [75]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [76]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [77]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [78]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [79]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [80]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [81]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [82]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64